# Learning material

This notebook is for handy code snippets.

In [1]:
import pandas as pd
import numpy as np

### Error handling

#### Try, except

In [2]:
total_marks = int(input('Enter total marks'))
num_sections = int(input('Enter number of sections'))
try:
    marks_per_section = total_marks / num_sections
except ZeroDivisionError:
    print('The number of sections cannot equal 0')
else:
    print(marks_per_section)

The number of sections cannot equal 0

#### Assert

In [3]:
total_marks = int(input('Enter total marks'))
num_sections = int(input('Enter number of sections'))
assert(num_sections != 0), 'The number of sections cannot equal 0' 
marks_per_section = total_marks / num_sections

AssertionError: The number of sections cannot equal 0

### Pandas

#### String formatting

In [ ]:
a = 'Rachel'
b = 'Georgia'
d = 'Charlotte'
"The story of {0}, {1}, and {c}".format(a, b, c=d)

#### Shift

In [ ]:
df = pd.DataFrame({'balance': [15, 21, 23, 24], 
                  'value': [5, 6, 2, 1],})

cols = ['value', 'balance']
df = df[cols]

df['manual balance'] = df['balance'].shift() + df['value']
df['check balance'] = df['balance'] == df['manual balance']
df

#### Cumulative sum and groupby

In [ ]:
test = pd.DataFrame({'period': [1,1,1,2,2,3,3],
              'cost': [10,20,15,10,5,20,5]})

test = test[['period', 'cost']]
test['cumulative_sum'] = test.groupby('period')['cost'].cumsum()
test

#### Index of minimum/maximum

In [ ]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

In [ ]:
df.sum(axis=0).idxmin()

#### Creating random numbers

In [ ]:
df = pd.DataFrame(data = {'A': list(range(1, 101)), 
                     'B': np.random.randint(low = 0, high = 100, size = 100)})
df.head(10)

In [ ]:
pd.DataFrame(data = np.random.random(size = (10, 5)), 
            columns = ['oh','laddergoat', 'you', 'so', 'random'])

In [ ]:
# Keep same random numbers
np.random.seed(99)
df = pd.DataFrame(data = np.random.random(size = (10, 5)),
             columns = list('abcde'))
df

#### Assigning values in a dataframe to bins

In [57]:
df = pd.DataFrame(data = {'A': np.random.randint(low = 0, high = 100, size = 15), 
                     'B': np.random.randint(low = 0, high = 100, size = 15)})
df

     A   B
0   60  21
1   23  26
2   47  61
3   55  84
4   84  21
5   16  90
6   49  34
7   81  19
8   41   2
9   74  18
10   7  88
11  63  50
12  92  79
13  41  16
14  94  67

In [58]:
my_range = np.arange(0,101,10)
my_range

array([  0,  10,  20,  30,  40,  50,  60,  70,  80,  90, 100])

In [59]:
pd.cut(df['A'],my_range)

0      (50, 60]
1      (20, 30]
2      (40, 50]
3      (50, 60]
4      (80, 90]
5      (10, 20]
6      (40, 50]
7      (80, 90]
8      (40, 50]
9      (70, 80]
10      (0, 10]
11     (60, 70]
12    (90, 100]
13     (40, 50]
14    (90, 100]
Name: A, dtype: category
Categories (10, interval[int64]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] ... (60, 70] < (70, 80] < (80, 90] < (90, 100]]

#### Conditional formatting

##### Highlight null values

In [ ]:
df = pd.DataFrame(data = np.random.randint(low = 0, high = 9, size = (10, 5)), 
                  columns = list('abcde'))
df = df.replace(0, np.nan)
df.style.highlight_null(null_color='#ccccff')

##### Create heatmap

In [ ]:
import seaborn as sns
df = pd.DataFrame(data = np.random.random(size = (10, 5)), 
                  columns = list('abcde'))
cm = sns.light_palette("green", as_cmap=True)
s = df.style.background_gradient(cmap=cm)
s

##### Highlight min and max

In [ ]:
df.style.highlight_max(axis=0, color = 'pink')
# df.style.highlight_min(axis=0, color = 'blue')

#### Stack and unstack

In [ ]:
df = pd.DataFrame({'a': (1.0, 2.0),
                  'b': (3.0, 4.0)})
df

In [ ]:
s = df.stack()
s

In [ ]:
s.unstack()

##### Creating multi-index dataframes

In [ ]:
index = pd.MultiIndex.from_tuples([('one', 'a'), ('one', 'b'),
                                    ('two', 'a'), ('two', 'b')])
s = pd.Series(np.arange(1.0, 5.0), index=index)
s

#### Lambda expressions vs custom functions

In [54]:
df = pd.DataFrame({'a': range(1, 4),
                   'b': range(5, 8)})
df

   a  b
0  1  5
1  2  6
2  3  7

In [55]:
# Apply/transform using lambda function
df.apply(lambda x: x + 1)
df.transform(lambda x: x + 1)

# Note - both of these seem to behave as if inplace = False were selected

   a  b
0  2  6
1  3  7
2  4  8

In [56]:
# Applying transform using custom function
def add_one(s):
    s += 1
    return s

df.apply(add_one)
df.transform(add_one)

# Note - both of these seem to behave as if inplace = True were selected

   a  b
0  3  7
1  4  8
2  5  9

#### Apply vs transform

#### Rolling

In [62]:
df = pd.DataFrame({'period': [1,1,1,2,2,3,3],
              'cost': [10,20,15,10,5,20,5]})
df

   cost  period
0    10       1
1    20       1
2    15       1
3    10       2
4     5       2
5    20       3
6     5       3

In [67]:
df['cost'].rolling(3).mean()

0          NaN
1          NaN
2    15.000000
3    15.000000
4    10.000000
5    11.666667
6    10.000000
Name: cost, dtype: float64

In [68]:
df['cost'].rolling(2).sum()

0     NaN
1    30.0
2    35.0
3    25.0
4    15.0
5    25.0
6    25.0
Name: cost, dtype: float64

#### Resampling time series

In [70]:
index = pd.date_range('1/1/2000', periods=9, freq='T')
s = pd.Series(range(9), index=index)
s

2000-01-01 00:00:00    0
2000-01-01 00:01:00    1
2000-01-01 00:02:00    2
2000-01-01 00:03:00    3
2000-01-01 00:04:00    4
2000-01-01 00:05:00    5
2000-01-01 00:06:00    6
2000-01-01 00:07:00    7
2000-01-01 00:08:00    8
Freq: T, dtype: int64

In [73]:
# Downsampling into three minute intervals
s.resample('3T').sum()

2000-01-01 00:00:00     3
2000-01-01 00:03:00    12
2000-01-01 00:06:00    21
Freq: 3T, dtype: int64

In [76]:
# Upsampling into thirty second intervals
s.resample('30S').asfreq().head(5)

2000-01-01 00:00:00    0.0
2000-01-01 00:00:30    NaN
2000-01-01 00:01:00    1.0
2000-01-01 00:01:30    NaN
2000-01-01 00:02:00    2.0
Freq: 30S, dtype: float64

#### Grouper

In [2]:
np.random.seed(99)
index = pd.date_range(start = '2015-01-01', end = '2015-12-31', freq = 'B')
s = pd.Series(data = np.random.random(size = len(index)), 
              index = index)
# s

In [9]:
# Group into a different specified interval
s.groupby(pd.Grouper(freq = '4M')).idxmax()

2015-01-31   2015-01-13
2015-05-31   2015-05-27
2015-09-30   2015-07-13
2016-01-31   2015-11-10
dtype: datetime64[ns]

#### Interpolate

In [9]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [10]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

#### Convert a column of lists to multiple columns in a dataframe

In [13]:
df['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [11]:
df['RecentDelays'].apply(pd.Series)

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

#### MultiIndex

##### MultiIndex from product

In [3]:
numbers = [0, 1, 2]
colors = ['green', 'purple']
pd.MultiIndex.from_product([numbers, colors],
                           names=['number', 'color'])

MultiIndex(levels=[[0, 1, 2], ['green', 'purple']],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['number', 'color'])

##### MultiIndex from arrays

In [3]:
arrays = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex(levels=[[1, 2], ['blue', 'red']],
           codes=[[0, 0, 1, 1], [1, 0, 1, 0]],
           names=['number', 'color'])

##### MultiIndex from dataframe

In [4]:
df = pd.DataFrame([['HI', 'Temp'], ['HI', 'Precip'],
                    ['NJ', 'Temp'], ['NJ', 'Precip']],
                   columns=['a', 'b'])
pd.MultiIndex.from_frame(df)

MultiIndex(levels=[['HI', 'NJ'], ['Precip', 'Temp']],
           codes=[[0, 0, 1, 1], [1, 0, 1, 0]],
           names=['a', 'b'])

##### Checking if index is lexically sorted

In [108]:
index = pd.MultiIndex.from_frame(df)
index.is_lexsorted()

False

In [114]:
index.sort_values().is_lexsorted()

True

##### Slicing with multi-index

In [4]:
animals = ['dog', 'cat', 'fish']
shapes = ['triangle', 'rectangle', 'square']
sizes = ['small', 'large']

row_index = pd.MultiIndex.from_product([numbers, colors, animals])
column_index = pd.MultiIndex.from_product([sorted(sizes), sorted(shapes)])

df = pd.DataFrame(np.random.randint(5, 140, size = len(row_index) * len(column_index)).reshape(len(row_index), len(column_index)),
             index = row_index, 
             columns = column_index).sort_index()
df

                  large                     small
              rectangle square triangle rectangle square triangle
0 green  cat         78      7       19        13     21       22
         dog         28    119       19        12     82       59
         fish        95     55      129        60     80       99
  purple cat         16    139       76       125    103       32
         dog        118    121       43        40     95       35
         fish       119     16       62        96      9       29
1 green  cat         19     42      108       110     41       51
         dog         12    120       70       119     60       35
         fish       119     57       44        31     12       95
  purple cat          8    117      109       100     66      136
         dog         75     20       75        42     22        5
         fish        90     86       26        75    112       49
2 green  cat         37     61       40       113     44       32
         dog         50     53       19        87     91      126
         fish        53     77       35        18    126      134
  purple cat        119    108       69        98     18      131
         dog         28     78      138        19    114      101
         fish       124     24       62       109    132      131

In [104]:
df.loc[pd.IndexSlice[:, 'green', 'dog':'fish'], pd.IndexSlice['large', 'square':'triangle']]

              large
             square triangle
0 green dog      17       72
        fish     72       50
1 green dog      35       94
        fish    115      122
2 green dog     129       54
        fish     35       47

#### Order of operations

-  & has a higher operator precedence than ==. 
- Without the parentheses, `a['x']==1 & a['y']==10` would be evaluated as `a['x'] == (1 & a['y']) == 10` which would in turn be equivalent to the chained comparison `(a['x'] == (1 & a['y'])) and ((1 & a['y']) == 10)`. 
- This would trigger `ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().`

#### Indexing - iloc vs loc

In [11]:
df = pd.DataFrame({'A': list('abaab'), 
             'B': 'red, blue, blue, green, red'.split(',')}, 
            index = [2, 3, 5, 6, 7])
df

   A       B
2  a     red
3  b    blue
5  a    blue
6  a   green
7  b     red

In [15]:
# Loc refers to label-based indexing
df.loc[3]

A        b
B     blue
Name: 3, dtype: object

In [16]:
# Iloc refers to position-based indexing
df.iloc[3]

A         a
B     green
Name: 6, dtype: object

#### Methods for method chaining

##### Assign

In [169]:
df = pd.DataFrame({'A': list('abaab'), 
                   'B': 'red, blue, blue, green, red'.split(','), 
                   'C': np.arange(3, 8),
                   'D': ['2017-08-01', '2017-08-02', '2017-08-03', '2017-08-04', '2017-08-05']}, 
            index = [2, 3, 5, 6, 7])
df

   A       B  C           D
2  a     red  3  2017-08-01
3  b    blue  4  2017-08-02
5  a    blue  5  2017-08-03
6  a   green  6  2017-08-04
7  b     red  7  2017-08-05

In [157]:
# Can use assign with lambda function - x is the df
df = df.assign(lnC = lambda x: np.log(x['C']))
df

   A       B  C           D       lnC
2  a     red  3  2017-08-01  1.098612
3  b    blue  4  2017-08-02  1.386294
5  a    blue  5  2017-08-03  1.609438
6  a   green  6  2017-08-04  1.791759
7  b     red  7  2017-08-05  1.945910

In [158]:
# Can use assign with existing values
df = df.assign(log_of_lnC = np.log(df['lnC']))
df

   A       B  C           D       lnC  log_of_lnC
2  a     red  3  2017-08-01  1.098612    0.094048
3  b    blue  4  2017-08-02  1.386294    0.326634
5  a    blue  5  2017-08-03  1.609438    0.475885
6  a   green  6  2017-08-04  1.791759    0.583198
7  b     red  7  2017-08-05  1.945910    0.665730

In [161]:
# Using callables (lambda function)
df = df.assign(D = lambda x: pd.to_datetime(x['D']))
df

   A       B  C          D       lnC  log_of_lnC
2  a     red  3 2017-08-01  1.098612    0.094048
3  b    blue  4 2017-08-02  1.386294    0.326634
5  a    blue  5 2017-08-03  1.609438    0.475885
6  a   green  6 2017-08-04  1.791759    0.583198
7  b     red  7 2017-08-05  1.945910    0.665730

In [168]:
# Using row operations
df.assign(D = pd.to_datetime(df['D']))

   A       B  C          D
2  a     red  3 2017-08-01
3  b    blue  4 2017-08-02
5  a    blue  5 2017-08-03
6  a   green  6 2017-08-04
7  b     red  7 2017-08-05

##### Pipe

In [31]:
# Create custom function (this one extracts the city name away from the state e.g. Chicago, IL becomes Chicago)
def extract_city_name(df):
    cols = ['origin_city_name', 'dest_city_name']
    city = df[cols].apply(lambda x: x.str.extract("(.*), \w{2}", expand=False))
    df = df.copy()
    df[['origin_city_name', 'dest_city_name']] = city
    return df

# Note: The copy is added to avoid modifying the input dataframe

In [32]:
df = pd.DataFrame({'fl_num': np.arange(1, 6),
                   'origin_city_name': ['Chicago, IL', 'Nashville, TN', 'Chicago, IL', 'Chicago, IL', 'Nashville, TN'],
                   'dest_city_name': ['Cleveland, OH'] * 5})
df

   fl_num origin_city_name dest_city_name
0       1      Chicago, IL  Cleveland, OH
1       2    Nashville, TN  Cleveland, OH
2       3      Chicago, IL  Cleveland, OH
3       4      Chicago, IL  Cleveland, OH
4       5    Nashville, TN  Cleveland, OH

In [28]:
extract_city_name(df)

   fl_num origin_city_name dest_city_name
0       1          Chicago      Cleveland
1       2        Nashville      Cleveland
2       3          Chicago      Cleveland
3       4          Chicago      Cleveland
4       5        Nashville      Cleveland

In [30]:
df.pipe(extract_city_name)

   fl_num origin_city_name dest_city_name
0       1          Chicago      Cleveland
1       2        Nashville      Cleveland
2       3          Chicago      Cleveland
3       4          Chicago      Cleveland
4       5        Nashville      Cleveland

#### Set operations

In [203]:
# Split by parent
tine_children = pd.Index('rachel,georgia,charlotte'.split(','))
tim_children = pd.Index('liam,grace'.split(','))
anne_children = pd.Index('sally,alex,eliza,bella,harry'.split(','))

# Split by age
after_93 = pd.Index('georgia,charlotte,liam,grace,bella,harry'.split(','))
before_92 = pd.Index('rachel,sally,alex,eliza'.split(','))

In [204]:
# People in either tine_children or after_93 (not both)
tine_children ^ after_93

Index(['bella', 'grace', 'harry', 'liam', 'rachel'], dtype='object')

In [205]:
# People in both tine_children and after_93
tine_children & after_93

Index(['georgia', 'charlotte'], dtype='object')

In [206]:
# All of Tine, Anne and Tim children
younger_cousins = (tine_children | anne_children | tim_children)
younger_cousins

Index(['alex', 'bella', 'charlotte', 'eliza', 'georgia', 'grace', 'harry',
       'liam', 'rachel', 'sally'],
      dtype='object')

In [207]:
# Younger cousins excluding Anne children
younger_cousins.difference(anne_children)

Index(['charlotte', 'georgia', 'grace', 'liam', 'rachel'], dtype='object')

In [72]:
df = pd.DataFrame({'A': np.random.randint(1, 42, size = 7), 
             'B': np.random.randint(1, 42, size = 7), 
                  'index': [1, 1, 1, 2, 2, 3, 3]})
df

    A   B  index
0  10  30      1
1   1  32      1
2   6  21      1
3  39  16      2
4  23  14      2
5   2  32      3
6  15  33      3

In [73]:
df = df.set_index('index')

In [74]:
df['rank'] = df.groupby('index')['A'].cumcount() + 1
df

        A   B  rank
index
1      10  30     1
1       1  32     2
1       6  21     3
2      39  16     1
2      23  14     2
3       2  32     1
3      15  33     2

In [75]:
df['percentile'] = df['rank'] / df.groupby('index')['rank'].max()
df

        A   B  rank  percentile
index
1      10  30     1    0.333333
1       1  32     2    0.666667
1       6  21     3    1.000000
2      39  16     1    0.500000
2      23  14     2    1.000000
3       2  32     1    0.500000
3      15  33     2    1.000000